"""
Задача 1. Дан список чисел. Определите, сколько в нем
встречается различных чисел.
Input: [1, 1, 2, 0, -1, 3, 4, 4]
Output: 6
"""

# list_1 = []
# n = int(input('Input limit: '))
# for i in range(n):
#     list_1.append(int(input()))
# print(list_1)
# list_1 = set(list_1)
# print(len(list_1))


"""
Задача 2. Дана последовательность из N целых чисел и число
K. Необходимо сдвинуть всю последовательность
(сдвиг - циклический) на K элементов вправо, K –
положительное число.
Input: [1, 2, 3, 4, 5] k = 3
Output: [4, 5, 1, 2, 3]
""" 

# list_1 = []
# n = int(input('Input limit: '))
# for i in range(n):
#     list_1.append(int(input()))
# print(list_1)
# for i in range(int(input()) % n):
#     a = list_1.pop(- 1)
#     list_1.insert(0, a)
# print(list_1)


"""
Задача 3. Напишите программу для печати всех уникальных
значений в словаре.
Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
{"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII
":" S007 "}]
Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
"""

# a = [{"V":"S001"}, {"V":"S002"}, {"VI":"S001"}, {"VI":"S005"}, {"VII":"S005"}, {"V":"S009"}, {"VIII":"S007"}]
# # print(a[1]["V"]) #Доставать значеиня из списков списков !
# b = set()
# for i in a:
#     for j in i:
#         b.add(i[j])
# print(b, end = ' ')

"""
Задача 4. Дан массив, состоящий из целых чисел. Напишите
программу, которая подсчитает количество
элементов массива, больших предыдущего (элемента
с предыдущим номером)
Input: [0, -1, 5, 2, 3]
Output: 2 (-1 < 5, 2 < 3)
"""

# a = [0, -1, 5, 2, 3, -2]
# count = 0
# for i in range(len(a)):
#     if a[i] > a[- 1 - i]:
#         count += 1
# print(count)


