"""
Напишите программу, которая принимает на вход строку, 
и отслеживает, сколько раз каждый символ уже встречался. 
Количество повторов добавляется к символам с помощью постфикса формата _n.
"""

# n = input().split()
# print(n)
# a = {}
# for i in n:
#     if i in a:
#         print(f'{i}_{a[i]}', end = ' ')
#     else:
#         print(i, end = ' ')
#     a[i] = a.get(i, 0) + 1


"""
Пользователь вводит текст(строка). 
Словом считается последовательность непробельных символов идущих подряд, 
слова разделены одним или большим числом пробелов. Определите, 
сколько различных слов содержится в этом тексте.
"""
# n = input().upper().split()
# print(n)
# m = set(n)
# print(m)
# print(len(m))


"""
Пользователь вводит текст(строка). 
Словом считается последовательность непробельных символов идущих подряд, 
слова разделены одним или большим числом пробелов. Определите, 
сколько различных слов содержится в этом тексте. lls on th последовательность)
"""
# n = int(input())
# num_max = 0
# while n != 0:
#     n = int(input())
#     if num_max < n:
#         num_max = n
# print(num_max)

